# IsValidEndPoints Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTrayConduitBase..::..IsValidEndPoints Method
CableTrayConduitBase Class See Also
---
Identifies if two end points are valid.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool IsValidEndPoints(
	XYZ startPoint,
	XYZ endPoint
)
```

Visual Basic
---
```text
Public Shared Function IsValidEndPoints ( _
	startPoint As XYZ, _
	endPoint As XYZ _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidEndPoints(
	XYZ^ startPoint,
	XYZ^ endPoint
)
```

# ### Parameters
startPoint
    Type: Autodesk.Revit.DB..::..XYZ The start point of the location line.
endPoint
    Type: Autodesk.Revit.DB..::..XYZ The end point of the location line.
# ### Return Value
True if the two end points are valid, false otherwise.
# Remarks
The two points should not be too close.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
CableTrayConduitBase Class
Autodesk.Revit.DB.Electrical Namespace